Revit 2017 API
Surface Properties
The Surface type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Surface Class
Autodesk.Revit.DB Namespace